package stepic.exercises;

/**
 * Created by Alex on 20.09.2016.
 *
 * Напишите программу, выводящую в консоль It's alive! It's alive!
 * Класс должен называться "Main", это ограничение проверяющей системы.
 *
 * Переименовываем класс в Main, enjoy!
 */
public class Stepic_1_2_14 {
    public static void main(String[] args) {
        System.out.println("It's alive! It's alive!");
    }
}
